Repository: DevToys-app/DevToys
Catalog: src/app/dev/DevToys.Blazor/BuiltInTools/Settings/Settings.*.resx
Languages: ar_sa, cs_cz, da_dk, de_de, el_gr, es_es, fa_ir, fi_fi, fr_fr, hi_in, is_is, it_it, ja_jp, ko_kr, nl_nl, pl_pl, pt_br, ro_ro, tr_tr, uk_ua, zh_hans, zh_hant

# PasteClearsTextDescription
source: When clicking the Paste button, clear the text before pasting instead of appending to the existing text editor content.
ar_sa: عند الضغط على زر اللصق, أمح النص قبل اللصق بدل الإلحاق إلى محتوى محرر النص الموجود.
cs_cz: Při kliknutí na tlačítko Vložit odstranit text před vložením namísto připojení ke stávajícímu obsahu textového editoru.
da_dk: Når du klikker på indsæt-knappen, skal du slette teksten, før du indsætter den, i stedet for at føje den til det eksisterende teksteditorindhold.
de_de: Beim Klicken auf die Schaltfläche "Einfügen", den Text vor dem Einfügen löschen, anstatt ihn an den vorhandenen Texteditor-Inhalt anzuhängen.
el_gr: Όταν κάνετε κλικ στο κουμπί Επικόλληση, καθαρίστε το κείμενο πριν την επικόλληση αντί για προσθήκη στο υπάρχον περιεχόμενο του επεξεργαστή κειμένου.
es_es: Al hacer clic en el botón Pegar, borre el texto antes de pegar en lugar de añadir al contenido del editor de texto existente.
fa_ir: هنگامی که روی دکمه‌ی جای‌گذاری (Paste) کلیک می‌شود، پیش از جای‌گذاری متن فعلی پاک شود، به جای اینکه به محتوای فعلی ویرایشگر متن اضافه شود
fi_fi: Kun napsautat Liitä painiketta, poista teksti ennen liittämistä sen sijaan, että liitämme olemassa olevaan tekstieditorin sisältöön.
fr_fr: Lorsque vous cliquez sur le bouton Coller, effacez le texte existant avant de coller le nouveau texte.
hi_in: पेस्ट बटन पर क्लिक करते समय, मौजूदा टेक्स्ट एडिटर सामग्री में जोड़ने के बजाय पेस्ट करने से पहले टेक्स्ट को साफ़ करें।
is_is: Þegar ýtt er á Líma takkann, hreinsa textann fyrst í stað þess að bæta textanum við núverandi efni textaritils.
it_it: Al click del pulsante Incolla, cancella il testo prima d'incollarlo invece di aggiungerlo al contenuto esistente.
ja_jp: クリップボードから貼り付ける際に、入力されていた内容を消去して置き換えます
ko_kr: 내용이 있는 텍스트 편집기에서 붙여넣기 단추를 누르면 이어 붙이는 대신 기존 텍스트를 삭제합니다.
nl_nl: Bij het klikken op de knop Plakken, leeg de tekst voordat u plakt in plaats van aan de bestaande inhoud van de teksteditor toe te voegen.
pl_pl: Po kliknięciu przycisku "wklej", najpierw wyczyść tekst, a dopiero potem wklej go do aktualnej zawartości edytora tekstu.
pt_br: Ao clicar no botão Colar, limpar o texto antes de colar em vez de adicionar ao conteúdo existente no editor de texto.
ro_ro: Atunci când faceți clic pe butonul de lipit, ștergeți textul înainte de a lipi în loc să adăugați la conținutul existent al editorului de text.
tr_tr: Yapıştır düğmesine tıklarken, var olan metin düzenleyici içeriğinin sonuna eklemek yerine yapıştırmadan önce metni temizle.
uk_ua: Натискаючи кнопку "Вставити", очищує текст перед вставкою замість того, щоб додавати його до існуючого вмісту текстового редактора.
zh_hans: 点击粘贴按钮时，在粘贴之前清除文本，而不是添加到文本编辑器现有内容之后。
zh_hant: 當按下「貼上」按鈕時，會在貼上之前清除文字，而不是附加到現有文字編輯器的內容。

# PasteClearsTextStateDescriptionWhenOn
source: Replace text when pasting
ar_sa: غيّر النص عند اللصق
cs_cz: Nahradit text při vložení
da_dk: Erstat tekst ved indsætning
de_de: Text beim Einfügen ersetzen
el_gr: Αντικατάσταση κειμένου κατά την επικόλληση
es_es: Reemplazar texto al pegar
fa_ir: جایگزینی متن هنگام جای‌گذاری (paste)
fi_fi: Korvaa teksti liittäessäsi
fr_fr: Remplacer le texte lors du collage
hi_in: पेस्ट करते समय टेक्स्ट बदलें
is_is: Skipta út texta við límingu
it_it: Sostituisci il testo incollando
ja_jp: 貼り付け時に整形
ko_kr: 붙여넣을 때 텍스트 덮어쓰기
nl_nl: Tekst vervangen bij plakken
pl_pl: Zastąp tekst podczas wklejania
pt_br: Substituir texto ao colar
ro_ro: Înlocuiți textul la lipire
tr_tr: Yapıştırırken metni silip yerine koy
uk_ua: Замінювати текст під час вставки
zh_hans: 粘贴时替换文本
zh_hant: 貼上時取代文字

source: Render white space
ar_sa: جَبِّس فضاء أبيض
cs_cz: Vykreslit bílé znaky
da_dk: Gengive af hvidt mellemrumstegn
de_de: Leerraum/Leerzeichen rendern
el_gr: Απόδοση κενών χώρων
es_es: Renderizar espacio en blanco
fa_ir: نمایش کاراکترهای فاصله‌گذاری
fi_fi: Renderöi tyhjä tila
fr_fr: Afficher les espaces blanc
hi_in: सफेद स्थान प्रस्तुत करें
is_is: Sýna hvít bil
it_it: Visualizza spazi bianchi
ja_jp: 空白文字を表示
ko_kr: 공백 문자 표시
nl_nl: Witte ruimte weergeven
pl_pl: Renderuj znaki niedrukowane
pt_br: Renderizar espaço em branco
ro_ro: Redare spațiu alb
tr_tr: Boşlukları renderla
uk_ua: Відображення пробілів
zh_hans: 显示空白字符
zh_hant: 轉譯空白字元

# RenderWhitespaceStateDescriptionWhenOn
source: Show whitespace
ar_sa: أظهر فضاء ابيض
cs_cz: Zobrazit bílé znaky
da_dk: Vis hvid mellemrumstegn
de_de: Leerraum/Leerzeichen anzeigen
es_es: Mostrar espacio en blanco
fa_ir: نمایش کاراکترهای فاصله‌گذاری
fr_fr: Afficher les espaces blanc
is_is: Sýna hvít bil
it_it: Mostra spazi bianchi
ja_jp: 空白文字を表示
ko_kr: 공백 문자 표시
pl_pl: Pokaż znaki niedrukowane
pt_br: Mostrar espaço em branco
ro_ro: Arata spatiile albe
tr_tr: Boşluğu göster
uk_ua: Показувати пробіли
zh_hant: 顯示空白字元

# ShortDisplayTitle
source: Settings
ar_sa: الإعدادات
cs_cz: Nastavení
da_dk: Indstillinger
de_de: Einstellungen
el_gr: Ρυθμίσεις
es_es: Configuración
fa_ir: تنظیمات
fi_fi: Asetukset
fr_fr: Paramètres
is_is: Stillingar
it_it: Impostazioni
ja_jp: 設定
ko_kr: 설정
nl_nl: Instellingen
pl_pl: Ustawienia
pt_br: Configurações
ro_ro: Setări
tr_tr: Ayarlar
uk_ua: Налаштування
zh_hant: 設定

source: Smart detection
ar_sa: الكشف الذكي
cs_cz: Chytrá detekce
da_dk: Smart detektion
de_de: Intelligente Erkennung
el_gr: Έξυπνη ανίχνευση
es_es: Detección inteligente
fa_ir: تشخیص هوشمند
fi_fi: Älykäs tunnistus
fr_fr: Détection intelligente
is_is: Snjallgreining
it_it: Rilevamento Intelligente
ja_jp: スマート検出
ko_kr: 스마트 감지기
nl_nl: Slimme detectie
pl_pl: Inteligentny wybór narzędzia
pt_br: Detecção inteligente
ro_ro: Detectarea inteligentă
tr_tr: Akıllı algılama
uk_ua: Розумне визначення
zh_hant: 智慧偵測

# SmartDetectionDescription
source: Automatically detect the best tool based on the clipboard content
ar_sa: أكشف على أفضل أداة على أساس محتوى الحافظة تلقائيا
cs_cz: Automaticky detekovat nejlepší nástroj na základě obsahu schránky
da_dk: Automatisk find det bedste værktøj baseret på udklipsholdernes indhold
de_de: Automatisches Erkennen des besten Werkzeugs anhand des Inhalts der Zwischenablage
el_gr: Αυτόματη ανίχνευση του καλύτερου εργαλείου με βάση το περιεχόμενο του πρόχειρου
es_es: Detecta automaticamente la mejor herramienta en base a los contenidos del portapapeles
fa_ir: تشخیص خودکار بهترین ابزار بر اساس محتوای کلیپ‌برد
fi_fi: Tunnista automaattisesti paras työkalu leikepöydän sisällön perusteella
fr_fr: Détecter automatiquement le meilleur outil en fonction du contenu du presse-papiers
is_is: Greina sjálfkrafa besta tólið miðað við efni klippiborðs
it_it: Rileva automaticamente lo strumento adatto all'uso in base al contenuto degli appunti
ja_jp: クリップボードの内容から最適なツールを自動的に検出します
ko_kr: 클립보드 내용에 가장 적합한 도구를 자동으로 감지
nl_nl: Detecteer automatisch de beste tool op basis van de inhoud van het klembord
pl_pl: Automatycznie wykryj najlepsze narzędzie na podstawie zawartości schowka
pt_br: Automaticamente detectar a melhor ferramenta baseada no conteúdo da área de transferência
ro_ro: Detectează automat cel mai bun instrument bazat pe conținutul clipboard
tr_tr: Pano içeriğine bakarak en iyi aracı otomatik olarak algıla
uk_ua: Автоматично визначати найкращий інструмент на основі вмісту буфера обміну
zh_hant: 根據剪貼簿的內容自動偵測最佳工具

# SmartDetectionPaste
source: Automatically paste the clipboard content when selecting a recommended tool
ar_sa: ألصق محتوى الحافظة عند اختيار أداة موصى به تِلْقائيًا
cs_cz: Automaticky vložit obsah schránky při výběru doporučeného nástroje
da_dk: Automatisk indsæt udklipsholdernes indhold, når du vælger et anbefalet værktøj
de_de: Automatisches Einfügen des Inhalts der Zwischenablage bei Auswahl eines empfohlenen Werkzeugs
el_gr: Αυτόματη επικόλληση του περιεχόμενου του πρόχειρου κατά την επιλογή ενός συνιστώμενου εργαλείου
es_es: Pega automáticamente el contenido del portapapeles al seleccionar una herramienta recomendada
fa_ir: جای‌گذاری خودکار محتوای کلیپ‌برد هنگام انتخاب یک ابزار پیشنهادی
fi_fi: Liitä leikepöydän sisältö automaattisesti suositellun työkalun valinnassa
fr_fr: Coller automatiquement le contenu du presse-papier lors de la sélection d'un outil recommandé
is_is: Líma sjálfkrafa efni klippiborðs þegar valið er tól sem mælt er með
it_it: Incolla automaticamente il contenuto degli appunti quando selezioni uno strumento consigliato
ja_jp: 推奨ツールを選択するときにクリップボードの内容を自動的に貼り付けます
ko_kr: 클립보드 내용에 적합한 도구를 선택하면 자동으로 내용을 붙여 넣음
nl_nl: Plak de inhoud van het klembord automatisch bij het selecteren van een aanbevolen tool
pl_pl: Automatycznie wklej zawartość schowka po wybraniu zalecanego narzędzia
pt_br: Automaticamente colar o conteúdo da área de transferência quando selecionar a ferramenta recomendada
ro_ro: Lipiți automat conținutul clipboard-ului când selectați o unealtă recomandată
tr_tr: Tavsiye edilen bir araç seçerken pano içeriğini otomatik olarak yapıştır
uk_ua: Автоматично вставляти вміст буфера обміну при виборі рекомендованого інструмента
zh_hant: 選擇建議工具時自動貼上剪貼簿的內容

# SpecialThanks
source: Special thanks to
ar_sa: شكر جزيل إلى
cs_cz: Zvláštní poděkování
da_dk: En særlig tak til
de_de: Besonderen Dank an
el_gr: Ιδιαίτερες ευχαριστίες σε
es_es: Agradecimientos especiales a
fa_ir: با تشکر ویژه از
fi_fi: Erityiset kiitokset
fr_fr: Un grand merci à
is_is: Sérstakar þakkir til
it_it: Ringraziamenti speciali a
ko_kr: 도움 주신 분
nl_nl: Speciale dank aan
pl_pl: Szczególne podziękowania dla
pt_br: Agradecimentos especiais a
ro_ro: Mulțumiri speciale lui
tr_tr: Müteşekkir olduklarımız
uk_ua: Особлива подяка
zh_hant: 特別鳴謝

source: Text editor
ar_sa: محرر النص
cs_cz: Textový editor
da_dk: Teksteditor
el_gr: Επεξεργαστής κειμένου
es_es: Editor de Texto
fa_ir: ویرایشگر متن
fi_fi: Tekstin muokkain
fr_fr: Éditeur de texte
is_is: Textaritill
it_it: Editor di testo
ja_jp: テキストエディター
ko_kr: 텍스트 편집기
nl_nl: Tekst editor
pl_pl: Edytor tekstu
pt_br: Editor de texto
ro_ro: Editor de text
tr_tr: Metin düzenleyici
uk_ua: Текстовий редактор
zh_hant: 文字編輯器

# TextEditorPreview
source: Preview
ar_sa: معاينة
cs_cz: Náhled
da_dk: Forhåndsvisning
de_de: Vorschau
el_gr: Προεπισκόπηση
es_es: Vista previa
fa_ir: پیش‌نمایش
fi_fi: Esikatselu
fr_fr: Aperçu
is_is: Forskoðun
it_it: Anteprima
ja_jp: プレビュー
ko_kr: 미리보기
nl_nl: Voorvertoning
pl_pl: Podgląd
pt_br: Prévia
ro_ro: Previzualizare
tr_tr: Önizleme
uk_ua: Попередній перегляд
zh_hant: 預覽

source: Use system settings
ar_sa: أستخدم إعدادات النظام
cs_cz: Použít systémové nastavení
da_dk: Brug systemindstillinger
de_de: Systemeinstellungen verwenden
el_gr: Χρήση ρυθμίσεων συστήματος
es_es: Usar la configuración del sistema
fa_ir: استفاده از تنظیمات سیستم
fi_fi: Käytä järjestelmän asetuksia
fr_fr: Utiliser les paramètres du système
is_is: Nota kerfisstillingar
it_it: Usa le impostazioni di sistema
ja_jp: システムの言語に合わせる
ko_kr: 시스템 설정 사용
nl_nl: Systeeminstellingen gebruiken
pl_pl: Użyj ustawień systemowych
pt_br: Usar configurações do sistema
ro_ro: Utilizați setările de sistem
tr_tr: Sistem ayarlarını kullan
uk_ua: Як у системі
zh_hant: 使用系統設定

# Version
source: Version {0}
ar_sa: نسخة {0}
cs_cz: Verze {0}
el_gr: Έκδοση {0}
es_es: Versión {0}
fa_ir: نسخه‌ی {0}
fi_fi: Versio {0}
is_is: Útgáfa {0}
it_it: Versione {0}
ko_kr: 버전 {0}
nl_nl: Versie {0}
pl_pl: Wersja {0}
pt_br: Versão {0}
ro_ro: Versiunea {0}
tr_tr: Sürüm {0}
uk_ua: Версія {0}
zh_hant: 版本 {0}

# WordWrap
source: Wrap word
ar_sa: كلمة التفاف
cs_cz: Zalamování slov
da_dk: Ordombrydning
de_de: Wort umbrechen
el_gr: Αναδίπλωση λέξης
es_es: Ajuste de líneas
fa_ir: شکستن کلمات
fi_fi: Rivitä sana
fr_fr: Retour automatique à la ligne
is_is: Orðskrið
it_it: A capo automatico
ja_jp: 文字列を端で折り返す
ko_kr: 자동 줄 바꿈
nl_nl: Woord omslaan
pl_pl: Zawijaj wiersze
pt_br: Quebra de linha
ro_ro: Încadrează cuvântul
tr_tr: Sözcük kaydır
uk_ua: Переносити слова
zh_hant: 文字換行

# WordWrapStateDescriptionWhenOn
source: Word wrap
ar_sa: كلمة التفاف
cs_cz: Zalamování řádků
da_dk: Ordombrydning
de_de: Zeilenumbruch
el_gr: Αναδίπλωση λέξεων
es_es: Ajuste de línea
fa_ir: شکستن کلمات
fr_fr: Retour à la ligne automatique
is_is: Orðskrið
it_it: A capo automatico
ja_jp: 折り返す
ko_kr: 자동 줄 바꿈
nl_nl: Omloop woord
pl_pl: Zawijanie wierszy
pt_br: Quebra de linha
ro_ro: Încadrare cuvinte
tr_tr: Sözcük kaydır
uk_ua: Перенесення слів
zh_hant: 文字換行
