Repository: DevToys-app/DevToys
Catalog: src/app/dev/DevToys.Blazor/BuiltInTools/Settings/Settings.*.resx
Languages: ar_sa, cs_cz, da_dk, de_de, el_gr, es_es, fa_ir, fi_fi, fr_fr, hi_in, is_is, it_it, ja_jp, ko_kr, nl_nl, pl_pl, pt_br, ro_ro, tr_tr, uk_ua, zh_hans, zh_hant

source: About
ar_sa: عن
cs_cz: O aplikaci
da_dk: Om
de_de: Über
el_gr: Σχετικά
es_es: Acerca de
fa_ir: درباره
fi_fi: Tietoja
fr_fr: À propos de
hi_in: ऐप के बारे में
is_is: Um
it_it: Info su
ja_jp: アプリについて
ko_kr: 정보
nl_nl: Informatie
pl_pl: O aplikacji
pt_br: Sobre
ro_ro: Despre
tr_tr: Hakkında
uk_ua: Про застосунок
zh_hans: 关于
zh_hant: 關於

# AccessibleName
source: Settings
ar_sa: الإعدادات
cs_cz: Nastavení
da_dk: Indstillinger
de_de: Einstellungen
el_gr: Ρυθμίσεις
es_es: Configuración
fa_ir: تنظیمات
fi_fi: Asetukset
fr_fr: Paramètres
hi_in: सेटिंग्स
is_is: Stillingar
it_it: Impostazioni
ja_jp: 設定
ko_kr: 설정
nl_nl: Instellingen
pl_pl: Ustawienia
pt_br: Configurações
ro_ro: Setări
tr_tr: Ayarlar
uk_ua: Налаштування
zh_hans: 设置
zh_hant: 設定

source: Appearance
ar_sa: المظهر
cs_cz: Vzhled
da_dk: Udseende
de_de: Erscheinung
el_gr: Εμφάνιση
es_es: Apariencia
fa_ir: ظاهر
fi_fi: Ulkoasu
fr_fr: Apparence
hi_in: रंगरूप
is_is: Útlit
it_it: Aspetto
ja_jp: 言語と外観
ko_kr: 화면 표시
nl_nl: Uiterlijk
pl_pl: Wygląd
pt_br: Aparência
ro_ro: Aspectul
tr_tr: Görünüm
uk_ua: Зовнішній вигляд
zh_hans: 外观
zh_hant: 外觀

source: App theme
ar_sa: سمة البرنامَج
cs_cz: Motiv aplikace
da_dk: Applikationstema
de_de: App-Thema
el_gr: Θέμα εφαρμογής
es_es: Tema de la aplicación
fa_ir: تم برنامه
fi_fi: Sovelluksen teema
fr_fr: Thème de l'application
hi_in: ऐप थीम
is_is: Þema forrits
it_it: Tema dell'app
ja_jp: アプリのテーマ
ko_kr: 앱 테마
nl_nl: App thema
pl_pl: Motyw aplikacji
pt_br: Tema
ro_ro: Tema aplicației
tr_tr: Uygulama teması
uk_ua: Тема застосунку
zh_hans: 应用主题
zh_hant: 應用程式主題

# AppThemeDescription
source: Select which app theme to display
ar_sa: حدد أي سمة البرنامَج للعرض
cs_cz: Vyberte motiv aplikace, který se má zobrazit
da_dk: Vælg hvilket applikationstema, der skal vises
de_de: Wähle das anzuzeigende App-Thema aus
el_gr: Επιλέξτε το θέμα εφαρμογής που θα εμφανιστεί
es_es: Elije con que tema mostrar la aplicación
fa_ir: انتخاب کنید کدام تم برنامه نمایش داده شود
fi_fi: Valitse minkä sovelluksen teema näytetään
fr_fr: Sélectionner le thème à afficher dans l'application
hi_in: सलेक्ट करें कि कौन-सी ऐप थीम दिखानी है।
is_is: Velja hvaða þema forrits á að sýna
it_it: Seleziona quale tema dell'app visualizzare
ja_jp: アプリに表示される色を変更します
ko_kr: 사용할 테마 선택
nl_nl: Selecteer welk app-thema moet worden weergegeven
pl_pl: Wybierz motyw aplikacji
pt_br: Selecione qual tema será exibido
ro_ro: Selectați ce temă a aplicației să fie afișată
tr_tr: Gösterilecek uygulama temasını seçin
uk_ua: Виберіть тему інтерфейсу програми
zh_hans: 选择要使用的应用主题
zh_hant: 選擇要顯示的應用程式主題

# Behaviors
source: Behaviours
ar_sa: السلوكيات
cs_cz: Chování
da_dk: Adfærd
de_de: Verhaltensweisen
el_gr: Συμπεριφορές
es_es: Comportamiento
fa_ir: رفتارها
fi_fi: Käyttäytymiset
fr_fr: Comportements
hi_in: व्यवहार
is_is: Hegðanir
it_it: Azioni
ja_jp: 動作
ko_kr: 동작
nl_nl: Gedrag
pl_pl: Zachowania
pt_br: Comportamento
ro_ro: Comportamente
tr_tr: Davranışlar
uk_ua: Поведінка
zh_hans: 行为
zh_hant: 行為

# CompactMode
source: Compact spacing
ar_sa: تباعد مدمج
cs_cz: Kompaktní odsazování
da_dk: Kompakte mellemrum
de_de: Kompakter Abstand
el_gr: Συμπαγής απόσταση
es_es: Tema compacto
fa_ir: فاصله‌گذاری فشرده
fi_fi: Kompakti väli
fr_fr: Espacement compact
is_is: Þétt bil
it_it: Spazio compatto
ja_jp: 間隔を詰める
ko_kr: 좁게 보기
nl_nl: Compacte afstand
pl_pl: Kompaktowy odstęp
pt_br: Espaçamento compacto
ro_ro: Spațiere compactă
tr_tr: Sıkışık espas
uk_ua: Компактні відступи
zh_hans: 紧凑间距
zh_hant: 緊湊間距

# CompactModeDescription
source: Decrease space between UI elements
ar_sa: قلل المسافة بين عناصر الشاشة
cs_cz: Zmenšit prostor mezi prvky uživatelského rozhraní
da_dk: Mindre mellemrum mellem UI-elementer
de_de: Abstand zwischen UI-Elementen verkleinern
el_gr: Μείωση χώρου μεταξύ στοιχείων UI
es_es: Disminuir el espacio entre elementos de la interfaz
fa_ir: کاهش فضای بین المان‌های رابط کاربری
fi_fi: Vähennä tilaa käyttöliittymän elementtien välillä
fr_fr: Diminuer l'espace entre les éléments de l'interface utilisateur
hi_in: यूआई तत्वों के बीच स्थान कम करें
is_is: Minnka bil á milli UI eininga
it_it: Riduci lo spazio tra gli elementi dell'interfaccia utente
ja_jp: UI のスペースを縮小します
ko_kr: 사용자 인터페이스 요소 사이의 간격을 줄임
nl_nl: Verminder ruimte tussen UI-elementen
pl_pl: Zmniejsz odstęp między elementami interfejsu
pt_br: Diminuir espaço entre elementos da interface
ro_ro: Scade spațiul dintre elementele UI
tr_tr: Arayüz unsurları arasındaki boşluğu azalt
uk_ua: Зменшує проміжки між елементами інтерфейсу
zh_hans: 减少界面元素间的空间
zh_hant: 減少介面元素之間的空間

source: Dark
ar_sa: داكن
cs_cz: Tmavý
da_dk: Mørk
de_de: Dunkel
el_gr: Σκοτεινό
es_es: Oscuro
fa_ir: تیره
fi_fi: Tumma
fr_fr: Sombre
hi_in: डार्क
is_is: Dökkt
it_it: Scuro
ja_jp: ダーク
ko_kr: 어두운 테마
nl_nl: Donker
pl_pl: Ciemny
pt_br: Escuro
ro_ro: Întunecat
tr_tr: Koyu
uk_ua: Темна
zh_hans: 深色
zh_hant: 深色

# DefaultLanguage
source: Same as the system
ar_sa: نفس النظام
cs_cz: Stejný jako systém
da_dk: Brug computerindstilling
de_de: Dasselbe wie das System
el_gr: Ίδιο με το σύστημα
es_es: Igual que el sistema
fa_ir: همانند سیستم
fi_fi: Sama kuin järjestelmä
fr_fr: Identique au système
hi_in: सिस्टम के समान
is_is: Sama og kerfið
it_it: Stesso del sistema
ja_jp: システム設定を使用する
ko_kr: 시스템 설정 사용
nl_nl: Hetzelfde als het systeem
pl_pl: Taki sam jak w systemie
pt_br: Usar configurações do sistema
ro_ro: La fel ca sistemul
tr_tr: Sistem ile aynı
uk_ua: Така ж, як і в системі
zh_hans: 跟随系统
zh_hant: 與系統相同

# Description
source: Customise DevToys look & feel
ar_sa: عدل منظر و مشعر DevToys
cs_cz: Přizpůsobte si vzhled a dojem DevToys
da_dk: Tilpas DevToys udseende og følelse
de_de: DevToys Erscheinungsbild anpassen & feel
el_gr: Προσαρμογή εμφάνισης & αίσθησης DevToys
es_es: Personalizar apariencia de DevToys
fa_ir: شخصی‌سازی حس و حال DevToys
fi_fi: Mukauta DevToys näyttää ja tuntuu
fr_fr: Personnaliser l'apparence et le comportement de DevToys
hi_in: DevToys के रूप और अनुभव को अनुकूलित करें
is_is: Sérsníða útlit og tilfinngu DevToys
it_it: Personalizza il look & feel dei DevToys
ja_jp: DevToys をカスタマイズする
ko_kr: DevToys의 인터페이스를 변경
nl_nl: Personaliseer DevToys look & feel
pl_pl: Dostosuj wygląd DevToys
pt_br: Personalizar o visual do DevToys
ro_ro: Personalizați aspectul și senzația dispozitivelor
tr_tr: DevToys görünümünü ve hissiyatını özelleştir
uk_ua: Налаштуйте зовнішній вигляд DevToys
zh_hans: 自定义 DevToys 的样子和风格
zh_hant: 自訂 DevToys 的外觀

# DevToysMac
source: {0} for starting DevToysMac development
ar_sa: {0} لبدأ لتطوير DevToysMac
cs_cz: {0} za zahájení vývoje DevToysMac
da_dk: {0} for at starte DevToyMac-udvikling
de_de: {0} zum Starten der DevToysMac-Entwicklung
el_gr: {0} για εκκίνηση ανάπτυξης DevToysMac
es_es: {0} para iniciar el desarrollo de DevToysMac
fa_ir: {0} برای آغاز توسعه‌ی DevToys
fi_fi: {0} DevToysMacin kehityksen aloittamiseksi
fr_fr: {0} pour avoir démarré le développement de DevToysMac
hi_in: {0} DevToysMac विकास शुरू करने के लिए
is_is: {0} fyrir að byrja DevToysMac þróun
it_it: {0} per l'avvio dello sviluppo di DevToysMac
ja_jp: DevToysMac の開発 : {0}
ko_kr: DevToysMac 개발을 시작한 {0}
nl_nl: {0} voor het starten van DevToysMac ontwikkeling
pl_pl: {0} za rozpoczęcie rozwoju DevToysMac
pt_br: {0} por iniciar o desenvolvimento do DevToysMac
ro_ro: {0} pentru a porni dezvoltarea DevToysMac
tr_tr: DevToysMac geliştirmesini başlattığı için {0}
uk_ua: {0} за початок розробки DevToysMac
zh_hans: {0} 用于开始 DevToysMac 开发
zh_hant: 由 {0} 開始 DevToysMac 的開發

source: Editing
ar_sa: تحرير
cs_cz: Úprava
da_dk: Redigering
de_de: Bearbeitung
el_gr: Επεξεργασία
es_es: Editar
fa_ir: ویرایش
fi_fi: Muokataan
fr_fr: Édition
hi_in: एडिटिंग
is_is: Ritvinna
it_it: Modifica
ja_jp: エディタ
ko_kr: 편집
nl_nl: Bewerken
pl_pl: Edytowanie
pt_br: Edição
ro_ro: Editare
tr_tr: Düzenleme
uk_ua: Редагування
zh_hans: 编辑
zh_hant: 編輯中

# EndOfLinePreference
source: End Of Line character
ar_sa: حرف نهاية الصف
cs_cz: Charakter konce řádky
da_dk: Ende af linjetegn
de_de: Zeilenendezeichen
el_gr: Χαρακτήρας τέλους γραμμής
es_es: Carácter de final de línea
fa_ir: کاراکتر انتهای خط
fi_fi: Rivin loppu
fr_fr: Caractère de fin de ligne
hi_in: पंक्ति का अंत वर्ण
is_is: Lokastafur línu
it_it: Carattere di fine riga
ja_jp: 改行コード
ko_kr: 줄 바꿈 문자
nl_nl: Einde van lijn teken
pl_pl: Znak końca linii
pt_br: Caractere de final de linha
ro_ro: Caracterul final al liniei
tr_tr: Satır Sonu karakteri
uk_ua: Символ кінця рядка
zh_hans: 行尾字符
zh_hant: 行尾字元

# EndOfLinePreferenceAutomatic
source: Same end of line as input (automatic)
ar_sa: نفس نهاية الصف كما المدخل (تلقائياً)
cs_cz: Stejný konec řádku jako vstup (automaticky)
da_dk: Samme end af linje som imput (automatisk)
de_de: Gleiches Zeilenende wie bei der Eingabe (automatisch)
el_gr: Ίδιο άκρο γραμμής με την είσοδο (αυτόματο)
es_es: Mismo fin de línea que el origen(automático)
fa_ir: انتهای خط همسان با ورودی (خودکار)
fi_fi: Sama rivin loppu kuin syöte (automaattinen)
fr_fr: Même fin de ligne que l'entrée (automatique)
hi_in: इनपुट के समान पंक्ति का अंत (स्वचालित)
is_is: Sami lokastafur og inntak (sjálfkrafa)
it_it: Stessa carattere di fine riga dell'input (automatico)
ja_jp: 入力された内容に合わせる (自動判別)
ko_kr: 입력한 줄 바꿈 문자와 동일(자동 적용)
nl_nl: Dezelfde eind van de regel als invoer (automatisch)
pl_pl: Taki sam jak w wejściu (automatycznie)
pt_br: Mesmo fim de linha que a origem (automático)
ro_ro: Același sfârșit de linie ca și intrarea (automată)
tr_tr: Girdi ile aynı satır sonu (otomatik)
uk_ua: Той самий, що й у вхідних даних (автоматично)
zh_hans: 与输入一致的行尾（自动）
zh_hant: 與輸入一致的行尾（自動）

# EndOfLinePreferenceCRLF
source: Carriage Return and Line Feed (\r\n) (Windows)
ar_sa: إرجاع الحمل و خلاصة الصف (\r\n) (ويندوز)
cs_cz: Znaky Carriage Return a Line Feed (\r\n) (Windows)
da_dk: Vognretur og Linjeskift (\r\n) (Windows)
de_de: Wagenrücklauf und Zeilenvorschub (\r\n) (Windows)
es_es: Devolución de transporte y alimentación de línea (\r\n) (Windows)
fa_ir: Carriage Return و Line Feed (\r\n) (ویندوز)
fi_fi: Kuljetuksen palautus ja linja syöte (\r\n) (Windows)
fr_fr: Retour chariot et flux de ligne (\r\n) (Windows)
hi_in: कैरिज रिटर्न और लाइन फ़ीड (\r\n) (विंडोज़)
is_is: Vagnsskil og línuskil (\r\n) (Windows)
it_it: Ritorno a capo e nuova riga (\r\n) (Windows)
ja_jp: CR+LF (\r\n) (Windows)
ko_kr: 캐리지 리턴과 라인 피드(\r\n) (윈도우 방식)
nl_nl: Terugkeer- en regelfeed (\r\n) (Windows)
pt_br: Retorno de carro (CR) e nova linha (LF) (\r\n) (Windows)
ro_ro: Transport Return and Line Feed (\r\n) (Windows)
tr_tr: Satır Başı ve Yeni Satır (\r\n) (Windows)
uk_ua: Повернення каретки та переведення рядка (\r\n) (Windows)
zh_hans: 回车和换行（\r\n）（Windows）
zh_hant: 回車和換行（\r\n）（Windows）

# EndOfLinePreferenceLF
source: Line Feed (\n) (Unix)
ar_sa: خلاصة الصف (\n) (Unix)
da_dk: Linjeskift (\n) (Unix)
de_de: Zeilenvorschub (\n) (Unix)
el_gr: Γραμμή Τροφοδοσίας (\n) (Unix)
es_es: Alimento de línea (\n) (Unix)
fa_ir: Line Feed (\n) (یونیکس)
fi_fi: Rivirehu (\n) (Unix)
fr_fr: Flux de ligne (\n) (Unix)
hi_in: लाइन फ़ीड (\n) (यूनिक्स)
is_is: Línuskil (\n) (Unix)
it_it: Nuova riga (\n) (Unix)
ja_jp: LF (\n) (Unix)
ko_kr: 라인 피드(\n) (유닉스 방식)
nl_nl: Lijnfeed (\n) (Unix)
pt_br: Nova linha (LF) (\n) (Unix)
ro_ro: Flux linie (\n) (Unix)
tr_tr: Yeni Satır (\n) (Unix)
uk_ua: Переведення рядка (\n) (Unix)
zh_hans: 回车（\n）（Unix）
zh_hant: 換行（\n）（Unix）

source: Font
ar_sa: خط النص
cs_cz: Písmo
da_dk: Skrifttype
de_de: Schriftart
es_es: Fuente
fa_ir: قلم
fr_fr: Police de caractère
hi_in: फ़ॉन्ट
is_is: Letur
ja_jp: フォント
ko_kr: 글꼴
pl_pl: Czcionka
pt_br: Fonte
tr_tr: Yazı tipi
uk_ua: Шрифт
zh_hans: 字体
zh_hant: 字型

# HelpTranslating
source: Help us translating DevToys!
ar_sa: ساعدنا نترجم DevToys!
cs_cz: Pomozte nám s překladem DevToys!
da_dk: Hjælp os med at oversætte DevToys!
de_de: Hilf uns beim Übersetzen von DevToys!
el_gr: Βοηθήστε μας να μεταφράσουμε DevToys!
es_es: ¡Ayúdanos a traducir DevToys!
fa_ir: در ترجمه‌ی DevToys به ما کمک کنید!
fi_fi: Auta meitä kääntämään DevToys!
fr_fr: Aidez-nous à traduire DevToys!
hi_in: DevToys का अनुवाद करने में हमारी सहायता करें!
is_is: Help us translate DevToys!
it_it: Aiutaci a tradurre DevToys!
ja_jp: DevToys の翻訳にご協力ください！
ko_kr: DevToys 번역을 도와주세요!
nl_nl: Help ons DevToys te vertalen!
pl_pl: Pomóż nam przetłumaczyć DevToys!
pt_br: Ajude-nos a traduzir o DevToys!
ro_ro: Ajută-ne să traducem DevToys!
tr_tr: DevToys'u çevirmemize yardım et!
uk_ua: Допоможіть нам перекласти DevToys!
zh_hans: 帮助我们翻译 DevToys！
zh_hant: 幫助我們翻譯 DevToys！

source: Highlight current line
ar_sa: عَلِّن صف الحالي
cs_cz: Zvýraznit aktuální řádek
da_dk: Vælg den nuværende linje
de_de: Aktuelle Zeile hervorheben
el_gr: Επισήμανση τρέχουσας γραμμής
es_es: Resaltar la línea actual
fa_ir: خط فعلی را برجسته کنید
fi_fi: Korosta tämänhetkinen rivi
fr_fr: Surligner la ligne en cours d'édition
hi_in: वर्तमान लाइन को हाइलाइट करें
is_is: Auðkenna núverandi línu
it_it: Evidenzia riga corrente
ja_jp: カーソル行を強調
ko_kr: 현재 줄 강조
nl_nl: Huidige lijn markeren
pl_pl: Podkreśl obecną linię
pt_br: Realçar linha atual
ro_ro: Evidențiază linia curentă
tr_tr: Şu anki satırı vurgula
uk_ua: Виділяти поточний рядок
zh_hans: 突出显示当前行
zh_hant: 突出顯示目前行

# HighlightCurrentLineDescription
source: Change the background colour of the current line so it's more visible
ar_sa: غيّر لون خلفية الصف الحالي لتكون واضحة أكثر
cs_cz: Změnit barvu pozadí aktuálního řádku tak, aby byl lépe viditelný
da_dk: Ændr baggrundsfarve på den valgt linje for at gøre den mere synlig
de_de: Ändere die Hintergrundfarbe der aktuellen Zeile, damit sie besser sichtbar ist
el_gr: Αλλάξτε το χρώμα φόντου της τρέχουσας γραμμής ώστε να είναι πιο ορατό
es_es: Resaltar el color de fondo de la línea actual para hacerla más visible
fa_ir: تغییر رنگ پس‌زمینه‌ی خط جاری جهت واضح‌تر شدن
fi_fi: Muuta nykyisen rivin taustaväriä, jotta se on näkyvämpi
fr_fr: Changer la couleur d'arrière-plan de la ligne actuelle pour qu'elle soit plus visible
hi_in: वर्तमान लाइन की पृष्ठभूमि का रंग बदलें ताकि यह अधिक दिखाई दे
is_is: Breyta bakgrunnslit núverandi línu svo hún sé sýnilegri
it_it: Cambia il colore di sfondo della riga corrente in modo che sia più visibile
ja_jp: カーソルがある行の背景色を変更する
ko_kr: 선택한 줄이 더 잘 보이도록 배경색을 변경
nl_nl: Wijzig de achtergrondkleur van de huidige regel zodat deze zichtbaarder is
pl_pl: Zmień kolor tła bieżącej linii tak, aby była lepiej widoczna
pt_br: Mudar a cor de fundo da linha atual para torná-la mais visível
ro_ro: Schimbă culoarea de fundal a liniei curente astfel încât să fie mai vizibilă
tr_tr: Daha iyi görünebilmesi için şu anki satırın arka plan rengini değiştir
uk_ua: Змінює колір фону поточного рядка, щоб зробити його більш помітним
zh_hans: 改变当前行的背景颜色，使其更加明显
zh_hant: 變更目前所在行的背景顏色以使其更加明顯

# HighlightCurrentLineStateDescriptionWhenOn
source: Higlight the current line
ar_sa: عَلِّن صف الحالي
da_dk: Vælg den nuværende linje
de_de: Die aktuelle Zeile hervorheben
el_gr: Επισήμανση της τρέχουσας γραμμής
es_es: Resalta la línea actual
fa_ir: برجسته کردن خط فعلی
fi_fi: Näytä nykyinen rivi
fr_fr: Mettre en surbrillance la ligne actuelle
is_is: Auðkenna núverandi línu
ja_jp: 行を強調
ko_kr: 현재 줄 강조
nl_nl: De huidige lijn Higlight
pt_br: Realçar a linha atual
ro_ro: Higlight linia curentă
tr_tr: Şu anki satırı vurgula
zh_hans: 突出显示当前行

# IconDesigner
source: {0} for designing the app icon
ar_sa: {0} لتصميم أيقونة البرنامَج
cs_cz: {0} za návrh ikony aplikace
da_dk: {0} for at designe applikationsikonet
de_de: {0} für die Gestaltung des App-Symbols
el_gr: {0} για το σχεδιασμό του εικονιδίου της εφαρμογής
es_es: {0} para diseñar el icono de la aplicación
fa_ir: {0} برای طراحی آیکون برنامه
fi_fi: {0} sovelluskuvakkeen suunnittelussa
fr_fr: {0} pour la conception de l'icône de l'application
hi_in: {0} ऐप आइकन डिज़ाइन करने के लिए
is_is: {0} fyrir að hanna tákn forritsins
it_it: {0} per la progettazione dell'icona dell'applicazione
ja_jp: アプリアイコン : {0}
ko_kr: 앱 아이콘을 디자인한 {0}
nl_nl: {0} voor het ontwerpen van de app icoon
pl_pl: {0} za zaprojektowanie ikony aplikacji
pt_br: {0} por criar o ícone do aplicativo
ro_ro: {0} pentru proiectarea pictogramei aplicației
tr_tr: Uygulama simgesini tasarladığı için {0}
uk_ua: {0} за дизайн іконки програми
zh_hans: {0} 用于设计应用程序的图标
zh_hant: 由 {0} 設計應用程式圖示

source: Language
ar_sa: اللغة
cs_cz: Jazyk
da_dk: Sprog
de_de: Sprache
el_gr: Γλώσσα
es_es: Idioma
fa_ir: زبان
fi_fi: Kieli
fr_fr: Langue
hi_in: भाषा
is_is: Tungumál
it_it: Lingua
ja_jp: 言語
ko_kr: 언어
nl_nl: Taal
pl_pl: Język
pt_br: Idioma
ro_ro: Limba
tr_tr: Lisan
uk_ua: Мова
zh_hans: 界面语言
zh_hant: 語言

# LanguageDescription
source: The app needs to be restarted when selecting another language
ar_sa: البرنامَج يحتاج إلى إعادة تشغيل عند إختيار لغة أخرى
cs_cz: Po výběru jiného jazyka je třeba aplikaci restartovat
da_dk: DevToys-applikationen skal genstartes, når der vælges et andet sprog
de_de: Die App muss neu gestartet werden, wenn eine andere Sprache ausgewählt wird
el_gr: Η εφαρμογή πρέπει να επανεκκινηθεί κατά την επιλογή μιας άλλης γλώσσας
es_es: Es necesario reiniciar la aplicación para usar otro lenguaje
fa_ir: هنگام انتخاب زبان دیگر، برنامه باید راه‌اندازی مجدد شود
fi_fi: Sovellus täytyy käynnistää uudelleen, kun valitaan toinen kieli
fr_fr: L'application doit être redémarrée lorsque vous sélectionnez une autre langue
hi_in: किसी अन्य भाषा का चयन करते समय ऐप को Restart करने की आवश्यकता होती है
is_is: Endurræsa þarf forritið þegar valið er annað tungumál
it_it: È necessario riavviare l'applicazione quando si seleziona un'altra lingua
ja_jp: The app needs to be restarted when selecting another language. (要再起動)
ko_kr: 언어를 변경한 뒤에는 앱을 다시 시작해야 함
nl_nl: De app moet opnieuw worden gestart bij het selecteren van een andere taal
pl_pl: Aplikacja musi zostać uruchomiona ponownie po wybraniu innego języka
pt_br: O aplicativo precisa ser reiniciado ao mudar de idioma
ro_ro: Aplicația trebuie să fie repornită la selectarea altei limbi
tr_tr: Uygulama, başka bir dil seçildiğinde yeniden başlatılmalıdır
uk_ua: При виборі іншої мови програму потрібно перезапустити
zh_hans: 更改语言后必须重新启动应用程序
zh_hant: 選擇其他語言時需要重新啟動應用程式

source: Light
ar_sa: فاتح
cs_cz: Světlý
da_dk: Lys
de_de: Hell
el_gr: Φωτεινό
es_es: Claro
fa_ir: روشن
fi_fi: Vaalea
fr_fr: Clair
hi_in: रोशनी
is_is: Ljóst
it_it: Chiaro
ja_jp: ライト
ko_kr: 밝은 테마
nl_nl: Licht
pl_pl: Jasny
pt_br: Claro
ro_ro: Lumină
tr_tr: Açık
uk_ua: Світла
zh_hans: 亮色
zh_hant: 淺色

source: Line numbers
ar_sa: أرقام الصف
cs_cz: Čísla řádků
da_dk: Linjenumre
de_de: Zeilennummern
el_gr: Αριθμοί γραμμής
es_es: Número de línea
fa_ir: شماره‌ی خطوط
fi_fi: Rivinumerot
fr_fr: Numéros de ligne
hi_in: पंक्ति क्रमांक
is_is: Línunúmer
it_it: Numeri di riga
ja_jp: 行番号
ko_kr: 줄 번호
nl_nl: Regelnummers
pl_pl: Numery linii
pt_br: Número de linhas
ro_ro: Numere de linie
tr_tr: Satır numaraları
uk_ua: Номери рядків
zh_hans: 行号
zh_hant: 行號

# LineNumbersDescription
source: Display line numbers in the text editor
ar_sa: إظهار أرقام الصف في محرر النص
cs_cz: Zobrazit čísla řádků v textovém editoru
da_dk: Vis linjenumre i teksteditoren
de_de: Zeilennummern im Texteditor anzeigen
el_gr: Εμφάνιση αριθμών γραμμών στον επεξεργαστή κειμένου
es_es: Mostrar los números de línea en el editor de texto
fa_ir: نمایش شماره‌ی خطوط در ویرایشگر متن
fi_fi: Näytä rivinumerot tekstieditorissa
fr_fr: Afficher les numéros de ligne dans l'éditeur de texte
hi_in: टेक्स्ट एडिटर में लाइन नंबर प्रदर्शित करें
is_is: Sýna línunúmer í textaritlinum
it_it: Visualizza i numeri di riga nell'editor di testo
ja_jp: テキストエディターで行番号を表示する
ko_kr: 텍스트 편집기에 줄번호를 표시
nl_nl: Regelnummers in de teksteditor weergeven
pl_pl: Pokazuj numery linii w edytorze tekstu
pt_br: Mostrar número de linhas no editor de texto
ro_ro: Afișează numerele de linie în editorul de text
tr_tr: Metin düzenleyicide satır numaralarını göster
uk_ua: Показує номери рядків у текстовому редакторі
zh_hans: 在文本编辑器中显示行号
zh_hant: 在文字編輯器中顯示行號

# LineNumbersStateDescriptionWhenOn
source: Show line numbers
ar_sa: أظهر أرقام الصف
cs_cz: Zobrazit čísla řádků
da_dk: Vis linjenumre
de_de: Zeilennummern anzeigen
el_gr: Εμφάνιση αριθμών γραμμών
es_es: Mostrar números de líneas
fa_ir: نمایش شماره‌ی خطوط
fi_fi: Näytä rivinumerot
fr_fr: Afficher les numéros de ligne
hi_in: पंक्ति क्रमांक दिखाएँ
is_is: Sýna línunúmer
it_it: Mostra i numeri di riga
ja_jp: 行番号を表示
ko_kr: 줄 번호 표시
nl_nl: Regelnummers weergeven
pl_pl: Pokaż numery linii
pt_br: Mostrar número de linhas
ro_ro: Arată numerele de linie
tr_tr: Satır numaralarını göster
uk_ua: Показувати номери рядків
zh_hans: 显示行号
zh_hant: 顯示行號

# PasteClearsText
source: Replace text when pasting
ar_sa: غيّر النص عند اللصق
cs_cz: Nahradit text při vložení
da_dk: Erstat tekst ved indsætning
de_de: Text beim Einfügen ersetzen
el_gr: Αντικατάσταση κειμένου κατά την επικόλληση
es_es: Reemplazar texto al pegar
fa_ir: جایگزینی متن هنگام جای‌گذاری (paste)
fi_fi: Korvaa teksti liittäessäsi
fr_fr: Remplacer le texte lors du collage
hi_in: पेस्ट करते समय टेक्स्ट बदलें
is_is: Skipta út texta við límingu
it_it: Sostituisci il testo quando si incolla
ja_jp: 置換貼り付け
ko_kr: 붙여 넣을 때 텍스트 덮어쓰기
nl_nl: Tekst vervangen bij plakken
pl_pl: Zastąp tekst podczas wklejania
pt_br: Substituir texto ao colar
ro_ro: Înlocuiți textul la lipire
tr_tr: Yapıştırırken metni silip yerine koy
uk_ua: Заміна тексту під час вставки
zh_hans: 粘贴时替换文本
zh_hant: 貼上時取代文字
